[
    {
        "title": "The Jester Memoir",
        "content": "Back in those days when the summers were cozy and the trees were tall, I had all the opportunities to take a glance and look at all the visual treats this world had to offer me. After a busy half-day of joyful laughs and the dreamy school chores, I managed to pick up a seat in my school bus. Usually, I would throw my bag on this seat to reserve it and race down to where my friends were standing to tell and hear some of the most spectacular real stories children could ever imagine, but today was different. Today I didn't want to take any chances. I didn't want to flash silly smiles to my ruthless bus-mates who didn't heed my bag and claimed my seat. So I stayed in the bus. I fixed my eyes on the giant bronze school emblem that looked so magnificent on the front top of the red school building, shining like there was room for one more sun in this universe. I had to look at it. I had to look at it so I could prepare my eyes for the grand finale.<br /><br />Slowly and eventually, the volume of the roaring in the bus increased and then attained a level that made it impossible for me to catch the sound of the engine starting, otherwise for which my ears were super-sensitive as it signaled the end of my friendly chat and the time to board. The ground started moving and my journey began. The wind was kind enough to evaporate the sweat off of my head. I donned a huge smile on my face as I just couldn't control the enthusiasm of a ten year old. Today, I was going to be able to focus my entire attention on the single most important thing that had made my heart jump in joy the day before yesterday.<br /><br />After spending some time in the drowsy ride of my magic bus, the moment came for which I had been laying the red carpet for. The bus stopped and I prayed the person expected to get off the bus moved slowly. This way, I would get ample amount of time for my eyes to savor. My calculations regarding on which side of the bus I will be able to view my visual treat were correct and they had landed me on the starboard side of the bus. Without much ado, I turned my head to perfectly lock my eyes on this variegated jester that was standing outside a restaurant. He was wearing these red and blue clothes, an abstruse set of shoes and a peculiarly shaped hat that sat prominently on his head. My best guess was that he was hired by the restaurant owner to allure customers to this place. The trick was ingenious as I was not only allured but also genuinely mesmerized. I had seen many jesters before, but this one was unique. This one was full of tremendous verve and the sight of a colorful figure in a concrete landscape was just fantastic. He was jumping and juggling balls and as he did so, yellow, orange and green candies spilled from his pockets. Some desirous kids surrounding him were grabbing those candies even before they could touch the ground. I envied those kids as I couldn't relish any of that jester-bestowed candy myself. That big grin on the jester’s face was utterly genuine as he enjoyed every bit of his act. Just yesterday, I had visited this place in the evening with my parents in hopes of seeing the jester up close but I couldn’t find him then. I was sad and disappointed but today’s events had healed any wounds. Even today, a loud voice in my head was asking me to rush down the bus, meet the jester, have some candy and be back in a jiffy but I couldn’t oblige as my bus revived to move. I bid bye to the jester king and got myself a memory that I still cherish. <br /><br />This incident made me ponder upon the existence of tiny joys that exist in our otherwise mundane lives - the joys that go unnoticed until we recognize them. The giant green trees that you see behind the traffic signal while waiting on a red light or the cloud art seen in the sky every now and then or the dark cool shade beneath an array of overgrown bushes all bring much needed peace and calm to the restless mind. I have many such memoirs but the jester memoir sits on the top. These memoirs enrich my heart with joy and whenever I recall them I am filled with a profound nostalgia that never fails to leave me smiling.",
        "path": "creative-writing/the-jester-memoir",
        "timestamp": "Feb 2013",
        "show": true
    },
    {
        "title": "The Classic Rock Juggernaut",
        "content": "It is the 70's era, the peak of Classic Rock and Led Zeppelin, the Gods, are performing live in an auditorium. Although the size of the auditorium didn’t justify the greatness of this rock group, they are playing their hearts out. Astonishingly and rather so audaciously, the audience is very meager. I am standing closest to them and fully engaged in the mind-boggling super-experience. They are playing Good Times Bad Times and the guitar solo after that deliberate brief pause in the music lifts me away from this world and into the depths of psych and bliss. This was the last number they were going to perform before leaving for another gig. Parallel to this hall is another hall that connects the backstage to the exit. I migrate to this parallel hall in hopes of coming face-to-face with the greatest band ever and take autographs of the big four.<br /><br />I am standing close to the exit door and see Led Zeppelin coming towards me flocked with reporters, journalists and other crazy fans. I am holding a click pen and a scrap of newspaper for taking their autographs. A few photographers are also there bursting their camera flashes in the dim hall. Leading Led Zeppelin is mighty Jimmy Page. I shake hands with him and tell him that I'm a huge fan of his and that I want his autograph. He refuses and gushes to the exit. I am under extreme shock and before I could recover, Robert Plant and John Paul Jones have already walked past me. I bring myself to senses as soon as possible and ask John Bonham, the immortal king of the drummers, for his autograph. He gestures for a pen which I give him along with the paper. He signs \"Bonzo\" and quickly walks towards the exit to catch up with his group. I watch the band get into their slick black wagon and wave them goodbye until their car vanished into a corner.<br /><br />I look at the paper to view my most precious Led Zeppelin memorabilia but to my utter surprise, it is only an imprint of Bonham’s autograph. I look at the pen and notice that I had forgotten to bring out the nib of that diabolic click pen before handing it over to Bonham. It was hilarious but at the same time, a bit disappointing. But watching Led Zeppelin perform live, then shaking hands with Jimmy and getting an imprint of Bonham’s autograph was enough for me to hold on to that newspaper snippet like it was the holy grail of the music world. Finally, I wake up from this abstruse dream.",
        "path": "creative-writing/the-classic-rock-juggernaut",
        "timestamp": "Jun 2014",
        "show": true
    },
    {
        "title": "Good and Evil",
        "content": "As a boy I often thought,<br />Is Good and Evil all what the world has got?<br />Always comparing the two,<br />Without knowing the real Truth.<br />That is hidden beneath for so many years,<br />Only to be unveiled by smiles and fears.<br /><br />For all I remember from my brief childhood,<br />Had there been no Evil, we would have found it in Good.<br /><br />Darker the night, brighter gets the day.<br />Most violent of the storms precede calmness in their way.<br />One can’t love dearly without facing hate.<br />One can only treasure life if it escaped death's fate.<br />There is no friend's charm if there is no foe's spell.<br />No one would ever want heaven if there was no place as hell.<br /><br />If I could explain better, I would,<br />Had there been no Evil, we would have found it in Good.<br /><br />Why to learn to fly if one has never cried?<br />Why to put the second effort if one has never tried?<br />What is food without the existence of hunger?<br />What is recreation without anything to plunder?<br />Who will be the hero with no villain to kill?<br />Who will praise life without anything still?<br /><br />So let the Good remain pure.<br />And be Evil it’s only cure.<br />Let us have some triumphs to celebrate.<br />And let that Truth forever wait.<br />Let our lives be reigned by tears.<br />And follow our destiny with smiles and fears.<br /><br />Be it the last time I say,<br />Had there been no Evil, we would have found it in Good.",
        "path": "creative-writing/good-and-evil",
        "timestamp": "May 2009",
        "show": true
    },
    {
        "title": "The Beatles Dream",
        "content": "It is The Beatles era around the mid 60’s. John Lennon and Paul McCartney are sitting on a long table addressing a press conference, answering questions and sharing thoughts about their next album. Ringo and George are not there. I am very near to that long table almost touching it. I pick up a greeting card from in front of them (which apparently they had received from another fan). It was sea green color and the inside was almost blank with just the upper right-side being scribbled. I took out a pen from my pocket and forwarded it along with the card to Lennon to have his autograph. He outright refuses and gestures me to have a seat with a look of despise on his face. I am heart-broken because of the fact I have always been the Lennon fan and not a McCartney fan. But to my surprise, Paul takes the pen and the card from me with a big smile on his face. He turns the inside of the card for everyone sitting in the room to see and starts writing on it. He writes 'from John' and pauses to look at Lennon who gives a nod and Paul completes Lennon's signature. He then also adds 'and Paul McCartney' and then a message which my memory can't recall. Then as an icing on the cake he asks my name. I tell it and he writes 'for Nav' and then looks at me for the remaining alphabets. I reply 'D-E-E-P'. By this time, big tears have started forming in my eyes and as he hands over the finished memorabilia, I am sobbing in joy. And then, I wake up. From that day onward, I started liking McCartney more than Lennon.",
        "path": "creative-writing/the-beatles-dream",
        "timestamp": "Dec 2015",
        "show": true
    },
    {
        "title": "Planet M",
        "content": "There was a place called Planet M. They had jukeboxes which I had never encountered before. I put those giant headphones on my little head and went into a world I didn't want to come back from. I remember swinging to U2's City of Blinding Lights and instantly planning to whine about getting their cassette. Then Bryan Adam's East Side Story played and I could literally feel some sort of fluid fill the veins of my brain. I needed this cassette too. I guess the stars were perfectly aligned that day as my parents bought me both the cassettes. I left Planet M as the most happiest kid on earth, clutching the polythene that contained my treasure so tight that not even the wind could sway it!",
        "path": "creative-writing/planet-m",
        "timestamp": "Mar 2006",
        "show": true
    },
    {
        "title": "Attending a Wedding",
        "content": "Attending a wedding when being little was simple. You just needed to get ready, hop on the vehicle that would take you to the lawns, bits of shy 'Hi's and 'Hello's there, a little stomach stuffing and then you dozed off right there despite of the loud noise. You would eventually wake up in your warm cozy bed the next morning and there would of course be flashes of how your mother or father carried you around, then put you in the vehicle and how he/she accidentally bumped your head with the door. Your head would hurt a little when you think about it. You would then go to school and share this experience with your friends in the lunch break- what you ate, what you saw and about that oddly-dressed old lady about whom you were convinced she puts little kids in her giant bag. And now that you've grown up you're an important part of the family contingent that goes to attend the wedding. You can't sleep off and most of all you can't hide. Mark your attendance, buddy, before the hosts think you came too late.",
        "path": "creative-writing/attending-a-wedding",
        "timestamp": "Jul 2008",
        "show": true
    }
]